In [273]:
import pandas as pd
from assign_unique_ids_functions import *
pd.options.display.max_columns = 999
import numpy as np
uhc = ['UID', 'Unit', 'Date', 'Event']

In [274]:
um1 = pd.read_csv('../input/ase-units.csv.gz')
um1.dropna(thresh=4, axis=0, inplace=True)
um1.rename(columns={'Effective.Date' : 'Start.Date'}, inplace=True)
um1.dropna(subset=['Start.Date'],inplace=True)
um1.drop('ase-units_ID', inplace=True, axis=1)
um1.loc[um1['End.Date'] < um1['Start.Date'], 'End.Date'] = np.nan
um1.drop_duplicates(inplace=True)
um1.head()

   Unit  Start.Date    End.Date  UID
0  14.0  2007-03-29         NaN    1
2  15.0  2007-03-29         NaN    2
4   1.0  1976-08-19  1976-08-20    3
5   4.0  1971-01-16  1976-08-18    3
6  22.0  1970-06-15  1971-01-15    3

In [275]:
um2 = pd.read_csv('../input/all-sworn-units.csv.gz')
um2.dropna(thresh=4, axis=0, inplace=True)
um2.dropna(subset=['Start.Date'],inplace=True)
um2.drop('all-sworn-units_ID', inplace=True, axis=1)
um2.loc[um2['End.Date'] < um2['Start.Date'], 'End.Date'] = np.nan
um2.drop_duplicates(inplace=True)
um2.head()

   Unit  Start.Date    End.Date  UID
0   3.0  2016-06-05         NaN    1
1  14.0  2007-03-29         NaN    1
2  14.0  2007-03-29  2016-06-04    1
3  15.0  2007-03-29         NaN    2
5   1.0  1976-08-19  1976-08-20    3

In [276]:
uh = pd.concat([um1, um2]).drop_duplicates()

In [277]:
uh.head()

   Unit  Start.Date    End.Date  UID
0  14.0  2007-03-29         NaN    1
2  15.0  2007-03-29         NaN    2
4   1.0  1976-08-19  1976-08-20    3
5   4.0  1971-01-16  1976-08-18    3
6  22.0  1970-06-15  1971-01-15    3

In [278]:
prof = pd.read_csv('officer-profiles.csv.gz')[['UID', 'Resignation.Date']]

In [279]:
prof = prof[(prof['UID'].isin(um1['UID'])) & (prof['Resignation.Date'].notnull())]

In [280]:
prof.columns = ['UID', 'End.Date']

In [281]:
uh_ed = uh[uh['End.Date'].notnull()]

In [282]:
uh_ned = uh[uh['End.Date'].isnull()].drop('End.Date', axis=1)
uh_ned = uh_ned.merge(prof, on='UID', how='left')

In [283]:
uh = uh_ed.append(uh_ned).reset_index(drop=True)

In [284]:
uh.sort_values(['UID', 'Start.Date']).head()

          End.Date  Start.Date  UID  Unit
76176   2016-06-04  2007-03-29    1  14.0
77153          NaN  2007-03-29    1  14.0
109674         NaN  2016-06-05    1   3.0
77154          NaN  2007-03-29    2  15.0
2       1971-01-15  1970-06-15    3  22.0

In [285]:
uh_kd = aggregate_data(keep_duplicates(uh, ['UID','Start.Date', 'Unit']) , uid='UID', id_cols=['Start.Date', 'Unit'], max_cols = ['End.Date'])

In [286]:
uh = remove_duplicates(uh,['UID','Start.Date', 'Unit']).append(uh_kd)

In [287]:
uh.sort_values(['UID', 'Start.Date']).head()

          End.Date  Start.Date  UID  Unit
0       2016-06-04  2007-03-29    1  14.0
109674         NaN  2016-06-05    1   3.0
77154          NaN  2007-03-29    2  15.0
2       1971-01-15  1970-06-15    3  22.0
1       1976-08-18  1971-01-16    3   4.0

In [288]:
max(uh['Start.Date'].dropna())

'2016-10-09'

In [289]:
max(uh['End.Date'].dropna())

'2017-08-24'

In [290]:
uh.sort_values('End.Date', ascending=True, na_position='first').tail(5)

         End.Date  Start.Date    UID   Unit
754    2017-08-15  2007-03-01   7576  116.0
90949  2017-08-19  2015-01-15  13454    5.0
1335   2017-08-19  2000-06-22  13454    7.0
88834  2017-08-19  1999-09-16  11359    2.0
96453  2017-08-24  2000-06-26  18928    2.0

In [291]:
pd.to_datetime(pd.date_range(start = max(uh['Start.Date'].dropna()), periods=2, closed='right', freq='MS'))[0]

Timestamp('2016-11-01 00:00:00', freq='MS')

In [292]:
date_cap = pd.to_datetime(pd.date_range(start = max(uh['Start.Date'].dropna()), periods=2, closed='right', freq='MS'))[0].date()

In [293]:
date_cap

datetime.date(2016, 11, 1)

In [294]:
uh.loc[(uh['End.Date'].isnull()) | 
       (pd.to_datetime(uh['End.Date']) > date_cap),
  'End.Date'] = pd.to_datetime(date_cap)
uh['End.Date']= pd.to_datetime(uh['End.Date'])

In [295]:
uh.reset_index(drop=True, inplace=True)

In [296]:
uh.head()

    End.Date  Start.Date  UID  Unit
0 2016-11-01  2016-06-05    1   3.0
1 2016-11-01  2007-03-29    2  15.0
2 1971-01-15  1970-06-15    3  22.0
3 1976-08-18  1971-01-16    3   4.0
4 1976-08-20  1976-08-19    3   1.0

In [297]:
uhm = uh.copy()

In [298]:
uhm['End.Date'] = uhm['End.Date'].map(lambda x: x.replace(day=1))

In [299]:
uhm['Start.Date'] = pd.to_datetime(uhm['Start.Date']).map(lambda x: x.replace(day=1))

In [327]:
uhm.head()

    End.Date Start.Date  UID  Unit  TID
0 2016-11-01 2016-06-01    1   3.0    1
1 2016-06-01 2007-03-01    1  14.0    1
2 2016-11-01 2007-03-01    2  15.0    2
3 1971-01-01 1970-06-01    3  22.0    3
4 1976-08-01 1971-01-01    3   4.0    3